In [177]:
import pandas as pd
import numpy as np

import pymysql                        
from sqlalchemy import create_engine

from getpass import getpass 

import seaborn as sns

# 1. Lab Python Connection

### 1.1 Establish a connection between Python and the Sakila database.

In [2]:
password = getpass()

········

In [3]:
connection = 'mysql+pymysql://root:'+password+'@localhost/sakila'

engine = create_engine(connection)

### 1.2 Rentals Month Function

Write a Python function that retrieves rental data for a given month and year from the Sakila database.

In [9]:
def rentals_month(engine, year, month):    
    query = 'SELECT *, substr(rental_date,6,2) as month, substr(rental_date,1,4) as year FROM rental WHERE substr(rental_date,6,2) = ' + month + ' AND substr(rental_date,1,4) = ' + year + ';'
    result = engine.execute(query)
    rows = [row for row in result]
    df = pd.DataFrame(rows)
    return df

month = '05'
year = '2005'

data_rental = rentals_month(engine, year, month)
# data_rental

### 1.3 Rental Count Funtion

Develop a Python function that returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [99]:
def rental_count_month(df, month, year):
    rentals_filtered = df[(df['month'] == month) & (df['year'] == year)]
    df2 = rentals_filtered.groupby('customer_id').size().reset_index(name = 'rentals_' + str(month) + '_' + str(year))
    return df2

data_count = rental_count_month(data_rental, month, year)
# data_count

### 1.4 Compare Rentals Function
Create a Python function that return a combined DataFrame with the difference between the number of rentals in two months.

In [100]:
def compare_rentals (df1, month1, year1, df2, month2, year2):    
    df3 = pd.merge(df1, df2, on = 'customer_id', how = 'outer', left_on=None, right_on=None, left_index=False, right_index=False, suffixes=('_df1', '_df2'), sort=True)    
    df3.fillna(0, inplace = True)   
    column1 = 'rentals_' + month1 + '_' + year1
    column2 = 'rentals_' + month2 + '_' + year2   
    df3['difference'] = (df3[column1] - df3[column2])  
    return df3

month1 = '05'
month2 = '02'

year1 = '2005'
year2 = '2006'

data_rental1 = rentals_month(engine,year1, month1)
data_rental2 = rentals_month(engine, year2, month2)

data_count1 = rental_count_month(data_rental1, month1, year1)
data_count2 = rental_count_month(data_rental2, month2, year2)

data_compare = compare_rentals(data_count1, month1, year1, data_count2, month2, year2)
# data_compare

# 2. Lab Logistic Regression
We would like to know which films will be rented.

### 1. Create a query or queries to extract the information you think may be relevant for building the prediction model. It should include some film features and some rental features (X). 

Y = We can determine our target will be table:
- film: And the column:
	- film_id

X = I believe these tables can provide information about which films are likely to be rented:

- film: Especially these columns:
	- release_year
	- language_id
	- rental_rate
	- length
	- rating
	- special_features
    
    
- rental: Especially these columns:
	- rental_date: Seasonal factors like summer, winter, or weekends could impact rentals.
	- staff_id: The staff member assisting the customer could provide recommendations.
    - customer_id: Rental preferences might depend on the customer's likes."
    
    
- actor: Especially these columns:
	- actor_id: Films may be rented depending on the actors who appear in them.
    
    
- category: Especially these columns:
	- category_id: To determine which categories are rented the most.


- payment: Especially this column:
	- amount: Rental choices might be influenced by the cost.

Now I need to find a common key to join the tables.

Film can be join with:

- rental: using table inventory: film-inventory joined on film_id and inventory-rental joined on inventory_id
- actor: as I only want actor_id, I´ll use table film_actor instead. It will be joined on film_id.
- category: as I only want category_id, I´ll use table film_category instead. It will be joined on film_id.
- payment: using table rental: film-rental already joined and payment-rental joined on rental_id

In [148]:
query_film = """
SELECT f.film_id, f.title, f.release_year, f.language_id, f.rental_rate, f.length, f.rating, f.special_features, 
       r.rental_date, r.staff_id, r.customer_id, a.actor_id, ca.category_id, p.amount

FROM sakila.film f

JOIN sakila.inventory i
USING(film_id)

JOIN sakila.rental r
USING(inventory_id)

JOIN sakila.film_actor a
USING(film_id)

JOIN sakila.film_category ca
USING(film_id)

JOIN sakila.payment p
USING(rental_id)
"""
film = pd.read_sql_query(query_film, engine)
film

,film_id,title,release_year,language_id,rental_rate,length,rating,special_features,rental_date,staff_id,customer_id,actor_id,category_id,amount
0,19,AMADEUS HOLY,2006,1,0.99,113,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2005-08-02 01:16:59,2,77,5,1,0.99
1,19,AMADEUS HOLY,2006,1,0.99,113,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2005-08-02 01:16:59,2,77,27,1,0.99
2,19,AMADEUS HOLY,2006,1,0.99,113,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2005-08-02 01:16:59,2,77,37,1,0.99
3,19,AMADEUS HOLY,2006,1,0.99,113,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2005-08-02 01:16:59,2,77,43,1,0.99
4,19,AMADEUS HOLY,2006,1,0.99,113,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2005-08-02 01:16:59,2,77,84,1,0.99
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
87975,989,WORKING MICROCOSMOS,2006,1,4.99,74,R,"Commentaries,Deleted Scenes",2005-08-23 02:06:01,2,385,37,16,6.99
87976,989,WORKING MICROCOSMOS,2006,1,4.99,74,R,"Commentaries,Deleted Scenes",2005-08-23 02:06:01,2,385,94,16,6.99
87977,989,WORKING MICROCOSMOS,2006,1,4.99,74,R,"Commentaries,Deleted Scenes",2005-08-23 02:06:01,2,385,138,16,6.99
87978,989,WORKING MICROCOSMOS,2006,1,4.99,74,R,"Commentaries,Deleted Scenes",2005-08-23 02:06:01,2,385,151,16,6.99
87979,989,WORKING MICROCOSMOS,2006,1,4.99,74,R,"Commentaries,Deleted Scenes",2005-08-23 02:06:01,2,385,188,16,6.99

I will check if some columns are handleable and categorical/numerical.

In [125]:
film['release_year'].value_counts()

2006    87980
Name: release_year, dtype: int64

In [126]:
film['language_id'].value_counts()

1    87980
Name: language_id, dtype: int64

In [127]:
film['rental_rate'].value_counts()

0.99    31130
2.99    28943
4.99    27907
Name: rental_rate, dtype: int64

In [128]:
film['rating'].value_counts()

PG-13    19065
PG       18635
NC-17    17630
R        17210
G        15440
Name: rating, dtype: int64

In [129]:
film['special_features'].value_counts()

Trailers,Commentaries,Behind the Scenes                   6898
Trailers                                                  6390
Trailers,Commentaries,Deleted Scenes,Behind the Scenes    6255
Behind the Scenes                                         6248
Commentaries                                              6210
Trailers,Behind the Scenes                                6199
Commentaries,Deleted Scenes,Behind the Scenes             6090
Trailers,Commentaries                                     6071
Commentaries,Deleted Scenes                               5864
Deleted Scenes,Behind the Scenes                          5808
Commentaries,Behind the Scenes                            5757
Deleted Scenes                                            5632
Trailers,Deleted Scenes                                   5374
Trailers,Commentaries,Deleted Scenes                      5248
Trailers,Deleted Scenes,Behind the Scenes                 3936
Name: special_features, dtype: int64

In [130]:
film['customer_id'].value_counts()

148    272
526    251
197    244
144    239
75     233
      ...
281     76
136     74
61      71
110     67
318     65
Name: customer_id, Length: 599, dtype: int64

In [131]:
film['actor_id'].value_counts()

107    753
181    678
198    674
144    654
102    640
      ...
35     255
199    255
31     235
186    221
148    216
Name: actor_id, Length: 200, dtype: int64

In [162]:
film['category_id'].value_counts()

15    72
8     67
9     67
2     64
6     63
1     61
7     60
13    60
14    59
3     58
10    58
5     56
4     54
11    53
16    52
12    51
Name: category_id, dtype: int64

I would keep date type columns, numerical and some categorical:

- I´ll drop language and year columns because all rows give the same information.
- I´d check which films and customers give relevant information with a pivot table to clasify them into smaller groups.
- I´ll keep the rest because the amount of data they give is balanced.

### 2. Create a query to get the list of all unique film titles and a boolean indicating if it was rented (rental_date) in May 2005. (Create new column called - 'rented_in_may'). This will be our **TARGET** (y) variable.

In [133]:
# query_film2 = """
# SELECT f.film_id, f.title, r.rental_date

# FROM sakila.film f

# JOIN sakila.inventory i
# USING(film_id)

# JOIN sakila.rental r
# USING(inventory_id)

# """
# film2 = pd.read_sql_query(query_film2, engine)
# film2

In [134]:
# film2.isna().sum()

In [135]:
# film2['rented_in_may'] = (film2['rental_date'].dt.month == 5) & (film2['rental_date'].dt.year == 2005)
# film2

In [136]:
# film2_pivot = film2.pivot_table(index=['title'], values = ['rented_in_may'], aggfunc = {'rented_in_may':'any'}).reset_index()
# film2_pivot

The aggfunc parameter is set to 'any', which means if there is at least one True value for a film, the result will be True, otherwise False.

Now I´ll do it straightway from SQL. I'll also select other variable I find relevant for the followinf exercise.

In [137]:
query_film2 = """
SELECT DISTINCT f.title, f.rating, f.rental_rate,
MAX(CASE WHEN r.rental_date IS NOT NULL THEN TRUE ELSE FALSE END) AS rented_in_may
FROM film f
LEFT JOIN inventory i
USING(film_id)
LEFT JOIN rental r
ON i.inventory_id = r.inventory_id
AND EXTRACT(YEAR FROM r.rental_date) = 2005
AND EXTRACT(MONTH FROM r.rental_date) = 5
GROUP BY f.title, f.rating, f.rental_rate;
"""

### 3. Read the data into a Pandas dataframe.  At this point you should have 1000 rows.  Number of columns depends on the number of features you chose.

In [191]:
film2 = pd.read_sql_query(query_film2, engine)
film2

                 title rating  rental_rate  rented_in_may
0     ACADEMY DINOSAUR     PG         0.99              1
1       ACE GOLDFINGER      G         4.99              0
2     ADAPTATION HOLES  NC-17         2.99              1
3     AFFAIR PREJUDICE      G         2.99              1
4          AFRICAN EGG      G         2.99              1
..                 ...    ...          ...            ...
995     YOUNG LANGUAGE      G         0.99              0
996         YOUTH KICK  NC-17         0.99              0
997       ZHIVAGO CORE  NC-17         0.99              1
998  ZOOLANDER FICTION      R         2.99              1
999          ZORRO ARK  NC-17         4.99              1

[1000 rows x 4 columns]

### 4. Analyze extracted features (X) and transform them. You may need to encode some categorical variables, or scale numerical variables.

In [192]:
# Merge with other values
film = film[['title', 'length', 'category_id']]
film = film.drop_duplicates()
film2 = pd.merge(left = film2, right = film, how = 'left', left_on = "title", right_on= "title").reset_index(drop=True,)
film2

                 title rating  rental_rate  rented_in_may  length  category_id
0     ACADEMY DINOSAUR     PG         0.99              1    86.0          6.0
1       ACE GOLDFINGER      G         4.99              0    48.0         11.0
2     ADAPTATION HOLES  NC-17         2.99              1    50.0          6.0
3     AFFAIR PREJUDICE      G         2.99              1   117.0         11.0
4          AFRICAN EGG      G         2.99              1   130.0          8.0
..                 ...    ...          ...            ...     ...          ...
995     YOUNG LANGUAGE      G         0.99              0   183.0          6.0
996         YOUTH KICK  NC-17         0.99              0   179.0         12.0
997       ZHIVAGO CORE  NC-17         0.99              1   105.0         11.0
998  ZOOLANDER FICTION      R         2.99              1   101.0          3.0
999          ZORRO ARK  NC-17         4.99              1    50.0          5.0

[1000 rows x 6 columns]

In [193]:
film2['rental_rate'].value_counts()

0.99    341
4.99    336
2.99    323
Name: rental_rate, dtype: int64

In [194]:
film2['rating'].value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [195]:
film2['category_id'].value_counts()

15.0    72
8.0     67
9.0     67
2.0     64
6.0     63
1.0     61
13.0    60
7.0     60
14.0    59
10.0    58
3.0     58
5.0     56
4.0     54
11.0    53
16.0    52
12.0    51
Name: category_id, dtype: int64

In [196]:
pd.crosstab(film2.rental_rate, film2.rented_in_may)

rented_in_may    0    1
rental_rate
0.99            99  242
2.99           110  213
4.99           105  231

I can see this variable is not very interesting, because for all rates the rental is almost the same.

In [197]:
pd.crosstab(film2.rating, film2.rented_in_may)

rented_in_may   0    1
rating
G              52  126
NC-17          68  142
PG             65  129
PG-13          68  155
R              61  134

In [200]:
pd.crosstab(film2.category_id, film2.rented_in_may)

rented_in_may   0   1
category_id
1.0            11  50
2.0            15  49
3.0            18  40
4.0            14  40
5.0            18  38
6.0            12  51
7.0            10  50
8.0            15  52
9.0            21  46
10.0           19  39
11.0           23  30
12.0           15  36
13.0           24  36
14.0           13  46
15.0           23  49
16.0           20  32

In [202]:
film2.corr()

C:\Users\PC\AppData\Local\Temp\ipykernel_17620\243240025.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  film2.corr()

               rented_in_may  category_id    length
rented_in_may       1.000000    -0.090004  0.003993
category_id        -0.090004     1.000000  0.060162
length              0.003993     0.060162  1.000000

I will only keep category_id. The length is not correlated at all.

In [203]:
film2 = film2[['title', 'rented_in_may', 'category_id' ]].reset_index(drop=True)
film2

                 title  rented_in_may  category_id
0     ACADEMY DINOSAUR              1          6.0
1       ACE GOLDFINGER              0         11.0
2     ADAPTATION HOLES              1          6.0
3     AFFAIR PREJUDICE              1         11.0
4          AFRICAN EGG              1          8.0
..                 ...            ...          ...
995     YOUNG LANGUAGE              0          6.0
996         YOUTH KICK              0         12.0
997       ZHIVAGO CORE              1         11.0
998  ZOOLANDER FICTION              1          3.0
999          ZORRO ARK              1          5.0

[1000 rows x 3 columns]

### 5. Create a logistic regression model to predict 'rented_in_may' from the cleaned data.

### 6. Evaluate the results.